[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=16
subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# Downsample

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

# Downsample

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

# Downsample

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

# Downsample

[convolutional]
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

# Downsample

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

######################

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=300
activation=linear


[yolo]
mask = 40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59
anchors = 13.78, 13.86, 15.1, 16.86, 22.29, 22.41, 22.7, 23.57, 22.89, 23.09, 23.59, 24.14, 24.96, 23.64, 24.78, 26.58, 25.63, 27.55, 27.88, 42.07, 31.89, 32.05, 34.15, 34.01, 38.89, 33.48, 37.47, 37.98, 36.34, 39.55, 37.97, 51.59, 43.72, 58.98, 50.93, 47.65, 49.07, 47.14, 55.76, 55.34, 56.56, 60.65, 57.67, 62.26, 67.01, 71.21, 73.51, 65.9, 92.97, 106.7, 102.7, 120.1, 123.1, 114.8, 125.9, 122.7, 132.5, 143.1, 143.9, 154.7, 11.82, 12.05, 13.8, 15.26, 19.68, 19.92, 20.12, 19.41, 20.63, 20.7, 21.71, 21.78, 21.76, 23.62, 22.73, 21.82, 22.97, 23.5, 25.45, 20.31, 29.3, 30.26, 28.65, 29.84, 26.15, 30.98, 28.31, 32.69, 35.91, 34.66, 38.23, 28.29, 39.31, 31.55, 38.09, 41.22, 43.22, 45.52, 46.69, 50.57, 49.93, 47.41, 53.78, 55.8, 63.56, 62.4, 70.51, 83.73, 91.68, 84.44, 92.64, 92.02, 90.19, 102.7, 107.6, 112.3, 120.8, 125.7, 137.4, 207.2
classes=0
num=60
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1


[route]
layers = -4

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 61



[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=300
activation=linear


[yolo]
mask = 20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39
anchors = 13.78, 13.86, 15.1, 16.86, 22.29, 22.41, 22.7, 23.57, 22.89, 23.09, 23.59, 24.14, 24.96, 23.64, 24.78, 26.58, 25.63, 27.55, 27.88, 42.07, 31.89, 32.05, 34.15, 34.01, 38.89, 33.48, 37.47, 37.98, 36.34, 39.55, 37.97, 51.59, 43.72, 58.98, 50.93, 47.65, 49.07, 47.14, 55.76, 55.34, 56.56, 60.65, 57.67, 62.26, 67.01, 71.21, 73.51, 65.9, 92.97, 106.7, 102.7, 120.1, 123.1, 114.8, 125.9, 122.7, 132.5, 143.1, 143.9, 154.7, 11.82, 12.05, 13.8, 15.26, 19.68, 19.92, 20.12, 19.41, 20.63, 20.7, 21.71, 21.78, 21.76, 23.62, 22.73, 21.82, 22.97, 23.5, 25.45, 20.31, 29.3, 30.26, 28.65, 29.84, 26.15, 30.98, 28.31, 32.69, 35.91, 34.66, 38.23, 28.29, 39.31, 31.55, 38.09, 41.22, 43.22, 45.52, 46.69, 50.57, 49.93, 47.41, 53.78, 55.8, 63.56, 62.4, 70.51, 83.73, 91.68, 84.44, 92.64, 92.02, 90.19, 102.7, 107.6, 112.3, 120.8, 125.7, 137.4, 207.2
classes=0
num=60
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1



[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 36



[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=300
activation=linear


[yolo]
mask = 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
anchors = 13.78, 13.86, 15.1, 16.86, 22.29, 22.41, 22.7, 23.57, 22.89, 23.09, 23.59, 24.14, 24.96, 23.64, 24.78, 26.58, 25.63, 27.55, 27.88, 42.07, 31.89, 32.05, 34.15, 34.01, 38.89, 33.48, 37.47, 37.98, 36.34, 39.55, 37.97, 51.59, 43.72, 58.98, 50.93, 47.65, 49.07, 47.14, 55.76, 55.34, 56.56, 60.65, 57.67, 62.26, 67.01, 71.21, 73.51, 65.9, 92.97, 106.7, 102.7, 120.1, 123.1, 114.8, 125.9, 122.7, 132.5, 143.1, 143.9, 154.7, 11.82, 12.05, 13.8, 15.26, 19.68, 19.92, 20.12, 19.41, 20.63, 20.7, 21.71, 21.78, 21.76, 23.62, 22.73, 21.82, 22.97, 23.5, 25.45, 20.31, 29.3, 30.26, 28.65, 29.84, 26.15, 30.98, 28.31, 32.69, 35.91, 34.66, 38.23, 28.29, 39.31, 31.55, 38.09, 41.22, 43.22, 45.52, 46.69, 50.57, 49.93, 47.41, 53.78, 55.8, 63.56, 62.4, 70.51, 83.73, 91.68, 84.44, 92.64, 92.02, 90.19, 102.7, 107.6, 112.3, 120.8, 125.7, 137.4, 207.2
classes=0
num=60
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
